nxp-mcuxpresso/mcux-soc-svd/MKE13Z9/MKE13Z9.xml
        <register>
          <name>MUL1</name>
          <description>TSI MUTUAL-CAP register 1</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5007E</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>M_NMIR_CTRL</name>
              <description>M_NMIR_CTRL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M_NMIR_CTRL_0</name>
                  <description>Enable NMOS mirror.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_NMIR_CTRL_1</name>
                  <description>Disable NMOS mirror.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M_NMIRROR</name>
              <description>M_NMIRROR</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M_NMIRROR_0</name>
                  <description>m=1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_NMIRROR_1</name>
                  <description>m=2.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_NMIRROR_2</name>
                  <description>m=3.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_NMIRROR_3</name>
                  <description>m=4.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M_PMIRRORR</name>
              <description>M_PMIRRORR</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M_PMIRRORR_0</name>
                  <description>m=1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PMIRRORR_1</name>
                  <description>m=2.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PMIRRORR_2</name>
                  <description>m=3.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PMIRRORR_3</name>
                  <description>m=4.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M_PMIRRORL</name>
              <description>M_PMIRRORL</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M_PMIRRORL_0</name>
                  <description>m=4.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PMIRRORL_1</name>
                  <description>m=8.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PMIRRORL_2</name>
                  <description>m=12.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PMIRRORL_3</name>
                  <description>m=16.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PMIRRORL_4</name>
                  <description>m=20.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PMIRRORL_5</name>
                  <description>m=24.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PMIRRORL_6</name>
                  <description>m=28.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PMIRRORL_7</name>
                  <description>m=32.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M_TRIM2</name>
              <description>M_TRIM2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M_VPRE_CHOOSE</name>
              <description>M_VPRE_CHOOSE</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M_VPRE_CHOOSE_0</name>
                  <description>Internal 1.2V voltage.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_VPRE_CHOOSE_1</name>
                  <description>1.2V PMC output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M_MODE</name>
              <description>M_MODE</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M_MODE_0</name>
                  <description>-5V~+5V.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_MODE_1</name>
                  <description>0V~+5V.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M_SEN_BOOST</name>
              <description>M_SEN_BOOST</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M_SEN_BOOST_0</name>
                  <description>0u.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_1</name>
                  <description>2u.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_2</name>
                  <description>4u.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_3</name>
                  <description>6u.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_4</name>
                  <description>8u.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_5</name>
                  <description>10u.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_6</name>
                  <description>12u.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_7</name>
                  <description>14u</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_8</name>
                  <description>16u.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_9</name>
                  <description>18u.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_10</name>
                  <description>20u.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_11</name>
                  <description>22u.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_12</name>
                  <description>24u.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_13</name>
                  <description>26u.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_14</name>
                  <description>28u.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_15</name>
                  <description>30u.</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_16</name>
                  <description>32u.</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_17</name>
                  <description>34u.</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_18</name>
                  <description>36u.</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_19</name>
                  <description>38u.</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_20</name>
                  <description>40u.</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_21</name>
                  <description>42u.</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_22</name>
                  <description>44u.</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_23</name>
                  <description>46u.</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_24</name>
                  <description>48u.</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_25</name>
                  <description>50u.</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_26</name>
                  <description>52u.</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_27</name>
                  <description>54u.</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_28</name>
                  <description>56u.</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_29</name>
                  <description>58u.</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_30</name>
                  <description>60u.</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_31</name>
                  <description>62u.</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
