nxp-mcuxpresso/mcux-soc-svd/MKE13Z9/MKE13Z9.xml
        <register>
          <name>LPFLLCSR</name>
          <description>Low Power FLL Control Status Register</description>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPFLLEN</name>
              <description>LPFLL Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>LPFLL is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>LPFLL is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPFLLTREN</name>
              <description>LPFLL Trim Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable trimming LPFLL to an reference clock source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable trimming LPFLL to an reference clock source</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPFLLTRUP</name>
              <description>LPFLL Trim Update</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable LPFLL trimming updates. LPFLL frequency determined by AUTOTRIM written value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable LPFLL trimming updates. LPFLL frequency determined by reference clock multiplication</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPFLLTRMLOCK</name>
              <description>LPFLL Trim LOCK</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_LOCKED</name>
                  <description>LPFLL not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED</name>
                  <description>LPFLL trimmed and locked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPFLLCM</name>
              <description>LPFLL Clock Monitor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>LPFLL Clock Monitor is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>LPFLL Clock Monitor is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPFLLCMRE</name>
              <description>LPFLL Clock Monitor Reset Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GENERATE_INTERRUPT</name>
                  <description>Clock Monitor generates interrupt when error detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GENERATE_RESET</name>
                  <description>Clock Monitor generates reset when error detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LK</name>
              <description>Lock Register</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITE_ENABLED</name>
                  <description>Control Status Register can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE_DISABLED</name>
                  <description>Control Status Register cannot be written.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPFLLVLD</name>
              <description>LPFLL Valid</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED_OR_NOT_VALID</name>
                  <description>LPFLL is not enabled or clock is not valid.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED_AND_VALID</name>
                  <description>LPFLL is enabled and output clock is valid.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPFLLSEL</name>
              <description>LPFLL Selected</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_LPFLL</name>
                  <description>LPFLL is not the system clock source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPFLL</name>
                  <description>LPFLL is the system clock source</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPFLLERR</name>
              <description>LPFLL Clock Error</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ERROR</name>
                  <description>Error not detected with the LPFLL trimming.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERROR</name>
                  <description>Error detected with the LPFLL trimming.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPFLLDIV</name>
          <description>Low Power FLL Divide Register</description>
          <addressOffset>0x504</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPFLLDIV2</name>
              <description>LPFLL Clock Divide 2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_1</name>
                  <description>Divide by 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2</name>
                  <description>Divide by 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4</name>
                  <description>Divide by 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_8</name>
                  <description>Divide by 8</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_16</name>
                  <description>Divide by 16</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_32</name>
                  <description>Divide by 32</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_64</name>
                  <description>Divide by 64</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPFLLCFG</name>
          <description>Low Power FLL Configuration Register</description>
          <addressOffset>0x508</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FSEL</name>
              <description>Frequency Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPFLL_48MHZ</name>
                  <description>LPFLL is trimmed to 48 MHz.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPFLL_72MHZ</name>
                  <description>LPFLL is trimmed to 72 MHz.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPFLL_96MHZ_2</name>
                  <description>LPFLL is trimmed to 96 MHz</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPFLLTCFG</name>
          <description>Low Power FLL Trim Configuration Register</description>
          <addressOffset>0x50C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIMSRC</name>
              <description>Trim Source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIRC</name>
                  <description>SIRC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRC</name>
                  <description>FIRC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOSC</name>
                  <description>System OSC</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIMDIV</name>
              <description>LPFLL Trim Predivide</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCKW2LSB</name>
              <description>Lock LPFLL with 2 LSBS</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WITHIN_1_LSB</name>
                  <description>LPFLL locks within 1LSB (0.4%)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WITHIN_2_LSBS</name>
                  <description>LPFLL locks within 2LSB (0.8%)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPFLLSTAT</name>
          <description>Low Power FLL Status Register</description>
          <addressOffset>0x514</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFF00</resetMask>
          <fields>
            <field>
              <name>AUTOTRIM</name>
              <description>Auto Tune Trim Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
