nxp-mcuxpresso/mcux-soc-svd/MKE13Z9/MKE13Z9.xml
        <register>
          <name>NVICICER</name>
          <description>Interrupt Clear Enable Register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>CLRENA0</name>
              <description>DMA channel 0 or 4 transfer complete interrupt clear-enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRENA0_0</name>
                  <description>write: no effect; read: DMA channel 0 or 4 transfer complete interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRENA0_1</name>
                  <description>write: disable DMA channel 0 or 4 transfer complete interrupt; read: DMA channel 0 or 4 transfer complete interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA1</name>
              <description>DMA channel 1 or 5 transfer complete interrupt clear-enable bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRENA1_0</name>
                  <description>write: no effect; read: DMA channel 1 or 5 transfer complete interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRENA1_1</name>
                  <description>write: disable DMA channel 1 or 5 transfer complete interrupt; read: DMA channel 1 or 5 transfer complete interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA2</name>
              <description>DMA channel 2 or 6 transfer complete interrupt clear-enable bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRENA2_0</name>
                  <description>write: no effect; read: DMA channel 2 or 6 transfer complete interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRENA2_1</name>
                  <description>write: disable DMA channel 2 or 6 transfer complete interrupt; read: DMA channel 2 or 6 transfer complete interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA3</name>
              <description>DMA channel 3 or 7 transfer complete interrupt clear-enable bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRENA3_0</name>
                  <description>write: no effect; read: DMA channel 3 or 7 transfer complete interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRENA3_1</name>
                  <description>write: disable DMA channel 3 or 7 transfer complete interrupt; read: DMA channel 3 or 7 transfer complete interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA4</name>
              <description>DMA error interrupt channels 0-7 interrupt clear-enable bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRENA4_0</name>
                  <description>write: no effect; read: DMA error interrupt channels 0-7 interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRENA4_1</name>
                  <description>write: disable DMA error interrupt channels 0-7 interrupt; read: DMA error interrupt channels 0-7 interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA5</name>
              <description>Single interrupt vector all sources interrupt clear-enable bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRENA5_0</name>
                  <description>write: no effect; read: Single interrupt vector all sources interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRENA5_1</name>
                  <description>write: disable Single interrupt vector all sources interrupt; read: Single interrupt vector all sources interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA6</name>
              <description>Low-voltage detect, low-voltage warning interrupt clear-enable bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRENA6_0</name>
                  <description>write: no effect; read: Low-voltage detect, low-voltage warning interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRENA6_1</name>
                  <description>write: disable Low-voltage detect, low-voltage warning interrupt; read: Low-voltage detect, low-voltage warning interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA7</name>
              <description>interrupt clear-enable bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRENA7_0</name>
                  <description>write: no effect; read: interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRENA7_1</name>
                  <description>write: disable interrupt; read: interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA8</name>
              <description>interrupt clear-enable bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRENA8_0</name>
                  <description>write: no effect; read: interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRENA8_1</name>
                  <description>write: disable interrupt; read: interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA9</name>
              <description>interrupt clear-enable bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRENA9_0</name>
                  <description>write: no effect; read: interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRENA9_1</name>
                  <description>write: disable interrupt; read: interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA10</name>
              <description>interrupt clear-enable bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRENA10_0</name>
                  <description>write: no effect; read: interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRENA10_1</name>
                  <description>write: disable interrupt; read: interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA11</name>
              <description>interrupt clear-enable bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRENA11_0</name>
                  <description>write: no effect; read: interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRENA11_1</name>
                  <description>write: disable interrupt; read: interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA12</name>
              <description>interrupt clear-enable bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRENA12_0</name>
                  <description>write: no effect; read: interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRENA12_1</name>
                  <description>write: disable interrupt; read: interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA13</name>
              <description>interrupt clear-enable bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRENA13_0</name>
                  <description>write: no effect; read: interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRENA13_1</name>
                  <description>write: disable interrupt; read: interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA14</name>
              <description>interrupt clear-enable bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRENA14_0</name>
                  <description>write: no effect; read: interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRENA14_1</name>
                  <description>write: disable interrupt; read: interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA15</name>
              <description>Analog-to-Digital Converter 0 interrupt clear-enable bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRENA15_0</name>
                  <description>write: no effect; read: Analog-to-Digital Converter 0 interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRENA15_1</name>
                  <description>write: disable Analog-to-Digital Converter 0 interrupt; read: Analog-to-Digital Converter 0 interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA16</name>
              <description>Analog comparator 0 interrupt interrupt clear-enable bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRENA16_0</name>
                  <description>write: no effect; read: Analog comparator 0 interrupt interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRENA16_1</name>
                  <description>write: disable Analog comparator 0 interrupt interrupt; read: Analog comparator 0 interrupt interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA17</name>
              <description>FlexTimer Module 0 interrupt clear-enable bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRENA17_0</name>
                  <description>write: no effect; read: FlexTimer Module 0 interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRENA17_1</name>
                  <description>write: disable FlexTimer Module 0 interrupt; read: FlexTimer Module 0 interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA18</name>
              <description>FlexTimer Module 1 interrupt clear-enable bit</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRENA18_0</name>
                  <description>write: no effect; read: FlexTimer Module 1 interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRENA18_1</name>
                  <description>write: disable FlexTimer Module 1 interrupt; read: FlexTimer Module 1 interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA19</name>
              <description>FlexTimer Module 2 interrupt clear-enable bit</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRENA19_0</name>
                  <description>write: no effect; read: FlexTimer Module 2 interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRENA19_1</name>
                  <description>write: disable FlexTimer Module 2 interrupt; read: FlexTimer Module 2 interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA20</name>
              <description>Single interrupt vector all sources interrupt clear-enable bit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRENA20_0</name>
                  <description>write: no effect; read: Single interrupt vector all sources interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRENA20_1</name>
                  <description>write: disable Single interrupt vector all sources interrupt; read: Single interrupt vector all sources interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA21</name>
              <description>UART0(SCI0) interrupt interrupt clear-enable bit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRENA21_0</name>
                  <description>write: no effect; read: UART0(SCI0) interrupt interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRENA21_1</name>
                  <description>write: disable UART0(SCI0) interrupt interrupt; read: UART0(SCI0) interrupt interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA22</name>
              <description>Periodic timer overflow interrupt clear-enable bit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRENA22_0</name>
                  <description>write: no effect; read: Periodic timer overflow interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRENA22_1</name>
                  <description>write: disable Periodic timer overflow interrupt; read: Periodic timer overflow interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA23</name>
              <description>interrupt clear-enable bit</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRENA23_0</name>
                  <description>write: no effect; read: interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRENA23_1</name>
                  <description>write: disable interrupt; read: interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA24</name>
              <description>interrupt clear-enable bit</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRENA24_0</name>
                  <description>write: no effect; read: interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRENA24_1</name>
                  <description>write: disable interrupt; read: interrupt enabled</description>
                  <value>0x1</value>
